harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
//*****************************************************************************
//
// tcu.c - Driver for the TCU.
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include "../inc/hw_tcu.h"
#include "../inc/hw_intc.h"
#include "../inc/hw_memmap.h"
#include "../inc/hw_types.h"
#include "./intc.h"
#include "debug.h"
#include "tcu.h"

//*****************************************************************************
//
// A mapping of TCU base address to interupt number.
//
//*****************************************************************************
static const unsigned long g_ppulTCUIntMap[][2] =
{
    { TCU_TIMER0, IRQ_NO_TCU2 },
    { TCU_TIMER1, IRQ_NO_TCU2 },
    { TCU_TIMER2, IRQ_NO_TCU2 },
    { TCU_TIMER3, IRQ_NO_TCU2 },
    { TCU_TIMER4, IRQ_NO_TCU2 },
    { TCU_TIMER5, IRQ_NO_TCU1 }, // timer5 use indepedent irq
    { TCU_TIMER6, IRQ_NO_TCU2 },
    { TCU_TIMER7, IRQ_NO_TCU2 },
};

//*****************************************************************************
//
//! \internal
//! Checks a TCU base address.
//!
//! \param ulBase is the base address of the TCU.
//!
//! This function determines if a TCU port base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUBaseValid(unsigned long ulBase)
{
    return(ulBase == TCU_BASE);
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerIDValid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER1) || 
           (ulTimerID == TCU_TIMER2) || (ulTimerID == TCU_TIMER3) || 
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) || 
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID is TCU1 valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is TCU1 group valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerTCU1Valid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID is TCU2 valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is TCU1 group valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerTCU2Valid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif
//*****************************************************************************
//
//! Gets the TCU interrupt number.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! Given a TCU Timer ID, this function returns the corresponding
//! interrupt number.
//!
//! \return Returns a TCU interrupt number, or -1 if \e ulTimerID is invalid.
//
//*****************************************************************************
long
TCUIntNumberGet(unsigned long ulTimerID)
{
    unsigned long ulIdx;

    //
    // Loop through the table that maps UART base addresses to interrupt
    // numbers.
    //
    for(ulIdx = 0; ulIdx < (sizeof(g_ppulTCUIntMap) /
                            sizeof(g_ppulTCUIntMap[0])); ulIdx++)
    {
        //
        // See if this base address matches.
        //
        if(g_ppulTCUIntMap[ulIdx][0] == ulTimerID)
        {
            //
            // Return the corresponding interrupt number.
            //
            return(g_ppulTCUIntMap[ulIdx][1]);
        }
    }

    //
    // The base address could not be found, so return an error.
    //
    return(-1);
}

//*****************************************************************************
//
//! Enable a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function enable only one TCU timer, when enabled begin counting up
//!
//! \return Returns true if enable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUCounterEnable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST7;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) == TCU_ER_TCEN7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST6;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN6) == TCU_ER_TCEN6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST5;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN5) == TCU_ER_TCEN5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST4;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN4) == TCU_ER_TCEN4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST3;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN3) == TCU_ER_TCEN3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST2;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN2) == TCU_ER_TCEN2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST1;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN1) == TCU_ER_TCEN1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST0;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN0) == TCU_ER_TCEN0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Disable a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function disable only one TCU timer, when disabled stop counting up
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUCounterDisable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL7;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) != TCU_ER_TCEN7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL6;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN6) != TCU_ER_TCEN6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL5;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) != TCU_ER_TCEN7);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL4;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN4) != TCU_ER_TCEN4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL3;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN3) != TCU_ER_TCEN3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL2;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN2) != TCU_ER_TCEN2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL1;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN1) != TCU_ER_TCEN1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL0;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN0) != TCU_ER_TCEN0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Supply clock of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function supply the clock of TCU timer, as a switch on the clock line.
//! it's just a switch, not any clock input source.
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUClockSupply(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC7;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP7) != TCU_SR_STOP7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC6;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP6) != TCU_SR_STOP6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC5;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP5) != TCU_SR_STOP5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC4;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP4) != TCU_SR_STOP4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC3;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP3) != TCU_SR_STOP3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC2;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP2) != TCU_SR_STOP2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC1;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP1) != TCU_SR_STOP1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC0;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP0) != TCU_SR_STOP0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Not supply(Stop) clock of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function stop the clock supply for a TCU timer.
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUClockNotSupply(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS7;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP7) == TCU_SR_STOP7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS6;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP6) == TCU_SR_STOP6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS5;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP5) == TCU_SR_STOP5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS4;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP4) == TCU_SR_STOP4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS3;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP3) == TCU_SR_STOP3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS2;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP2) == TCU_SR_STOP2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS1;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP1) == TCU_SR_STOP1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS0;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP0) == TCU_SR_STOP0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Shut down(Graceful mode) PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function using graceful mode to shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMShutdownGraceful(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~TCU_CSR7_SD;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_SD) != TCU_CSR7_SD);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~TCU_CSR6_SD;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_SD) != TCU_CSR6_SD);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~TCU_CSR5_SD;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_SD) != TCU_CSR5_SD);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_SD;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_SD) != TCU_CSR4_SD);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_SD;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_SD) != TCU_CSR3_SD);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_SD;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_SD) != TCU_CSR0_SD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Shut down(Abrupt mode) PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function using abupt mode to shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMShutdownAbrupt(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) |= TCU_CSR7_SD;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_SD) == TCU_CSR7_SD);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) |= TCU_CSR6_SD;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_SD) == TCU_CSR6_SD);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) |= TCU_CSR5_SD;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_SD) == TCU_CSR5_SD);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) |= TCU_CSR4_SD;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_SD) == TCU_CSR4_SD);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) |= TCU_CSR3_SD;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_SD) == TCU_CSR3_SD);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) |= TCU_CSR2_SD;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_SD) == TCU_CSR2_SD);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) |= TCU_CSR1_SD;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_SD) == TCU_CSR1_SD);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) |= TCU_CSR0_SD;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_SD) == TCU_CSR0_SD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Shut down PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulShutdown is the shut down mode, graceful or abrupt.
//!
//! This function shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
tBoolean
TCUPWMShutdown(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulShutdown)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));
    ASSERT((ulShutdown == TCU_SHUTDOWN_GRACEFUL) ||
           (ulShutdown == TCU_SHUTDOWN_ABRUPT));

    switch (ulShutdown) {
    case TCU_SHUTDOWN_GRACEFUL:
        return(TCUPWMShutdownGraceful(ulBase, ulTimerID));
    case TCU_SHUTDOWN_ABRUPT:
        return(TCUPWMShutdownAbrupt(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the TCU Timer clock input prescale.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulClockInputPrescale is the OST clock input prescale.
//!
//! This function set TCU Timer clock input prescale.
//!
//! \return None.
//
//*****************************************************************************
tBoolean
TCUClockInputPrescaleSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulClockInputPrescale)
{
    unsigned long prescale_field = 0;

    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulClockInputPrescale == TCU_CLOCKPRESCALE_1) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_4) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_16) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_64) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_256) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_1024));

    switch (ulClockInputPrescale) {
    case TCU_CLOCKPRESCALE_1:
        prescale_field = TCU_CSR_PRESCALE_1;
        break;
    case TCU_CLOCKPRESCALE_4:
        prescale_field = TCU_CSR_PRESCALE_4;
        break;
    case TCU_CLOCKPRESCALE_16:
        prescale_field = TCU_CSR_PRESCALE_16;
        break;
    case TCU_CLOCKPRESCALE_64:
        prescale_field = TCU_CSR_PRESCALE_64;
        break;
    case TCU_CLOCKPRESCALE_256:
        prescale_field = TCU_CSR_PRESCALE_256;
        break;
    case TCU_CLOCKPRESCALE_1024:
        prescale_field = TCU_CSR_PRESCALE_1024;
        break;
    default:
        ASSERT(false);
        return(false);
    }

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~TCU_CSR7_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR7) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_PRESCALE) == prescale_field);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~TCU_CSR6_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR6) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_PRESCALE) == prescale_field);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~TCU_CSR5_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR5) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_PRESCALE) == prescale_field);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR4) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_PRESCALE) == prescale_field);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR3) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_PRESCALE) == prescale_field);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) &= ~TCU_CSR2_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR2) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_PRESCALE) == prescale_field);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) &= ~TCU_CSR1_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR1) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_PRESCALE) == prescale_field);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR0) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_PRESCALE) == prescale_field);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the TCU Timer clock input(clock source).
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulClockInputPrescale is the OST clock input prescale.
//!
//! This function set TCU Timer clock input.
//!
//! \return None.
//
//*****************************************************************************
tBoolean
TCUClockInputSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulClockInput)
{
    unsigned long ulMask=0;
    unsigned long ulPrescale = 0;

    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT(ulClockInput == TCU_CLOCKINPUT_EXTAL ||
           ulClockInput == TCU_CLOCKINPUT_RTC   ||
           ulClockInput == TCU_CLOCKINPUT_PCLK);

    ulMask = TCU_CSR0_EXTEN | TCU_CSR0_RTCEN | TCU_CSR0_PCKEN;

